# 1. PANDAS BASICS

In [92]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [93]:
import pandas as pd

In [94]:
# Let's define two lists as shown below:
my_list=['AAPL','AMZN','T']
my_list

['AAPL', 'AMZN', 'T']

In [95]:
label=['stock1','stock2','stock3']
label

['stock1', 'stock2', 'stock3']

In [96]:
type(label)

list

In [97]:
type(my_list)

list

In [98]:
# Let's create a one dimensional Pandas "series" 
# Note that series is formed of data and associated labels 
x_series=pd.Series(data=my_list,index=label)

In [99]:
# Let's view the series
x_series

stock1    AAPL
stock2    AMZN
stock3       T
dtype: object

In [100]:
# Let's obtain the datatype
type(x_series)

pandas.core.series.Series

In [101]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df=pd.DataFrame({'Bankclient ID':[111,222,333,444],
                            'Bank client name':['Chanel','Mitch','Prince','Ryan'],
                            'Networth':[3500,29000,10000,2000],
                            'Years with bank':[3,4,9,5]})
bank_client_df

   Bankclient ID Bank client name  Networth  Years with bank
0            111           Chanel      3500                3
1            222            Mitch     29000                4
2            333           Prince     10000                9
3            444             Ryan      2000                5

In [102]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [103]:
# you can only view the first couple of rows using .head()
bank_client_df.head(2)

   Bankclient ID Bank client name  Networth  Years with bank
0            111           Chanel      3500                3
1            222            Mitch     29000                4

In [104]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(1)

   Bankclient ID Bank client name  Networth  Years with bank
3            444             Ryan      2000                5

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [105]:
portfolio_df=pd.DataFrame({'Stocks':["AAPL",'AMZN','TSLA'],
                          'Number of shares':[200,100,500],
                          'Price per share':[20,40,35]})
portfolio_df

  Stocks  Number of shares  Price per share
0   AAPL               200               20
1   AMZN               100               40
2   TSLA               500               35

In [106]:
stocks_dollar_value=portfolio_df['Number of shares']*portfolio_df['Price per share']
stocks_dollar_value
print('Total portfolio value={}'.format(stocks_dollar_value.sum()))

Total portfolio value=25500

# 2. PANDAS WITH CSV AND HTML DATA

In [107]:
# In order to access data on Google Drive, you need to mount the drive to access it's content
bank_df=pd.read_csv(".\\bank_client_information.csv")
bank_df

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [108]:
# Pandas is used to read a csv file and store data in a DataFrame

In [109]:
# write to a csv file without an index
bank_df.to_csv('sample_output.csv',index=False)

In [110]:
# write to a csv file with an index
# write to a csv file without an index
bank_df.to_csv('sample_output.csv',index=True)

In [111]:
pip install html5lib lxml beautifulsoup4

Requirement already satisfied: html5lib in c:\users\administrator\downloads\anaconda4\lib\site-packages (1.1)
Requirement already satisfied: lxml in c:\users\administrator\downloads\anaconda4\lib\site-packages (5.2.1)
Requirement already satisfied: beautifulsoup4 in c:\users\administrator\downloads\anaconda4\lib\site-packages (4.12.3)
Requirement already satisfied: six>=1.9 in c:\users\administrator\downloads\anaconda4\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\administrator\downloads\anaconda4\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\administrator\downloads\anaconda4\lib\site-packages (from beautifulsoup4) (2.5)
Note: you may need to restart the kernel to use updated packages.

In [112]:
# Read tabular data using read_html
house_prices_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')

In [113]:
house_prices_df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [114]:

import requests

url = "https://www.ssa.gov/oact/progdata/nra.html"

headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64)"
}

response = requests.get(url, headers=headers)
response.raise_for_status()

tables = pd.read_html(response.text)

retirement_age_df = tables[0]
retirement_age_df

C:\Users\Administrator\AppData\Local\Temp\ipykernel_9148\2710955812.py:12: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(response.text)

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...

# 3. PANDAS OPERATIONS

In [115]:
# Let's define a dataframe as follows:
bank_client_df

   Bankclient ID Bank client name  Networth  Years with bank
0            111           Chanel      3500                3
1            222            Mitch     29000                4
2            333           Prince     10000                9
3            444             Ryan      2000                5

In [116]:
# Pick certain rows that satisfy a certain criteria 
df_loyal=bank_client_df[(bank_client_df['Years with bank']>=5)]
df_loyal

   Bankclient ID Bank client name  Networth  Years with bank
2            333           Prince     10000                9
3            444             Ryan      2000                5

In [117]:
# Delete a column from a DataFrame
del bank_client_df['Bankclient ID']
bank_client_df

  Bank client name  Networth  Years with bank
0           Chanel      3500                3
1            Mitch     29000                4
2           Prince     10000                9
3             Ryan      2000                5

**MINI CHALLENGE #3:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [118]:
networth_df=bank_client_df[(bank_client_df['Networth']>=5000)]
networth_df

  Bank client name  Networth  Years with bank
1            Mitch     29000                4
2           Prince     10000                9

In [119]:
networth_df['Networth'].sum()

39000

# 4. PANDAS WITH FUNCTIONS

In [120]:
# Let's define a dataframe as follows:
bank_client_df

  Bank client name  Networth  Years with bank
0           Chanel      3500                3
1            Mitch     29000                4
2           Prince     10000                9
3             Ryan      2000                5

In [121]:
# Define a function that increases all clients networth (stocks) by a fixed value of 10% (for simplicity sake) 
def networth_update(balance):
    return balance *1.1

In [122]:
# You can apply a function to the DataFrame 
bank_client_df['Networth'].apply(networth_update)

0     3850.0
1    31900.0
2    11000.0
3     2200.0
Name: Networth, dtype: float64

In [123]:
bank_client_df['Bank client name'].apply(len)

0    6
1    5
2    6
3    4
Name: Bank client name, dtype: int64

In [124]:
bank_client_df['Years with bank'].sum()

21

**MINI CHALLENGE #4:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [125]:
portfolio_df

  Stocks  Number of shares  Price per share
0   AAPL               200               20
1   AMZN               100               40
2   TSLA               500               35

In [126]:
def new_prices(prices):
    return prices*2+100

In [127]:
# You can apply a function to the DataFrame 
portfolio_df['Price per share'].apply(new_prices)

0    140
1    180
2    170
Name: Price per share, dtype: int64

In [128]:
stocks_dollar_value=portfolio_df['Number of shares']*portfolio_df['Price per share']
stocks_dollar_value
print('Total portfolio value={}'.format(stocks_dollar_value.sum()))

Total portfolio value=25500

# 5. SORTING AND ORDERING

In [129]:
# Let's define a dataframe as follows:
bank_client_df

  Bank client name  Networth  Years with bank
0           Chanel      3500                3
1            Mitch     29000                4
2           Prince     10000                9
3             Ryan      2000                5

In [130]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by='Years with bank')

  Bank client name  Networth  Years with bank
0           Chanel      3500                3
1            Mitch     29000                4
3             Ryan      2000                5
2           Prince     10000                9

In [131]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bank_client_df.sort_values(by=['Years with bank'],inplace=True)

In [132]:
# Set inplace = True to ensure that change has taken place in memory 
bank_client_df

  Bank client name  Networth  Years with bank
0           Chanel      3500                3
1            Mitch     29000                4
3             Ryan      2000                5
2           Prince     10000                9

In [133]:
# Note that now the change (ordering) took place

**MINI CHALLENGE #5:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [134]:
bank_client_df.sort_values(by=['Networth'],inplace=True)
bank_client_df

  Bank client name  Networth  Years with bank
3             Ryan      2000                5
0           Chanel      3500                3
2           Prince     10000                9
1            Mitch     29000                4

# 6. CONCATENATING AND MERGING WITH PANDAS

Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [135]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    })

In [136]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    })

In [137]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    })

In [138]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [139]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [140]:
raw_data_1=pd.DataFrame({'Bank client ID':['1','2','3','4','5'],
          'First Name':['Nancy','Alex','shep','Maax','Allen'],
          'Last Name':['Rob','Ali','Goerge','Mitch','Steve']})

In [141]:
raw_data_1

  Bank client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       shep    Goerge
3              4       Maax     Mitch
4              5      Allen     Steve

In [142]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data_2=pd.DataFrame({'Bank client ID':['6','7','8','9','10'],
          'First Name':['Grace','Job','Colly','Jim','Mercy'],
          'Last Name':['Rya','Jay','Cam','Moyes','Fally']})
raw_data_2

  Bank client ID First Name Last Name
0              6      Grace       Rya
1              7        Job       Jay
2              8      Colly       Cam
3              9        Jim     Moyes
4             10      Mercy     Fally

In [143]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
raw_data_3=pd.DataFrame({'Bank client ID':['1','2','3','4','5','6','7','8','9','10'],
                         'Annual salary':[25000,3500,45000,49000,32000,33000,34000,23000,22000,27000]})
raw_data_3

  Bank client ID  Annual salary
0              1          25000
1              2           3500
2              3          45000
3              4          49000
4              5          32000
5              6          33000
6              7          34000
7              8          23000
8              9          22000
9             10          27000

In [144]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
bank_of_all=pd.concat([raw_data_1,raw_data_2])
bank_of_all

  Bank client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       shep    Goerge
3              4       Maax     Mitch
4              5      Allen     Steve
0              6      Grace       Rya
1              7        Job       Jay
2              8      Colly       Cam
3              9        Jim     Moyes
4             10      Mercy     Fally

In [145]:
# Let's merge all data on 'Bank Client ID'
bank_of_all=pd.merge(bank_of_all,raw_data_3,on='Bank client ID')
bank_of_all

  Bank client ID First Name Last Name  Annual salary
0              1      Nancy       Rob          25000
1              2       Alex       Ali           3500
2              3       shep    Goerge          45000
3              4       Maax     Mitch          49000
4              5      Allen     Steve          32000
5              6      Grace       Rya          33000
6              7        Job       Jay          34000
7              8      Colly       Cam          23000
8              9        Jim     Moyes          22000
9             10      Mercy     Fally          27000

**MINI CHALLENGE #6:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [151]:
my_info=pd.DataFrame({'Bank client ID':['11'],
                      'First Name':['Prince'],
                      'Last Name':['Obiero'],
                      'Annual salary':[35000],})
my_info

  Bank client ID First Name Last Name  Annual salary
0             11     Prince    Obiero          35000

In [152]:
bank_of_all=pd.concat([bank_of_all,my_info])
bank_of_all

  Bank client ID First Name Last Name  Annual salary  Annul salary
0              1      Nancy       Rob        25000.0           NaN
1              2       Alex       Ali         3500.0           NaN
2              3       shep    Goerge        45000.0           NaN
3              4       Maax     Mitch        49000.0           NaN
4              5      Allen     Steve        32000.0           NaN
5              6      Grace       Rya        33000.0           NaN
6              7        Job       Jay        34000.0           NaN
7              8      Colly       Cam        23000.0           NaN
8              9        Jim     Moyes        22000.0           NaN
9             10      Mercy     Fally        27000.0           NaN
0             11     Prince    Obiero            NaN       35000.0
0             11     Prince    Obiero        35000.0           NaN

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [148]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

  stock ticker symbols  price per share [$]  Number of stocks
0                 AAPL                 3500                 3
1                 AMZN                  200                 4
2                    T                   40                 9

In [149]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

0    10500
1      800
2      360
dtype: int64
Total portfolio value = 11660

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [150]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

HTTPError: HTTP Error 403: Forbidden

**MINI CHALLENGE #3 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [ ]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

In [ ]:
df_high_networth['Net worth [$]'].sum()

**MINI CHALLENGE #4 SOLUTION:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [ ]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

**MINI CHALLENGE #5 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [ ]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by = 'Net worth [$]', inplace = True) 
bank_client_df

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df